str_name = "suttisak"
int_old = 38
float_weight = 71.2
#====complex====== 
x = 6j
y = 3+5j
ans = x + y
#======== List ======  [...]
fruit=["apple","banana","cherry"]
#======== tuple =====  {...}
color =("Red","green","blue")
#======== range =======
data = range(0,5)
#======= Mapping or dic or json ====== 
member = {
           "name": "john", 
           "age": 25,
           "heigh": 175.2,
           "man" : True  
         }

True_man   =  True

# type(ตัวแปร)
print("--------------------------------------------------")
print("ชนิดข้อมูล:",type(str_name),"\tข้อมูลคือ:"+str_name)      #การใช้สัญลักษณ์พิเศษ \t วรรค \n ขึ้นบรรทัดใหม่
print("--------------------------------------------------")
print("ชนิดข้อมูล:",type(int_old),"\tข้อมูลคือ:",int_old)
print("--------------------------------------------------")
print("ชนิดข้อมูล:",type(float_weight),"\tข้อมูลคือ:",float_weight)
print("--------------------------------------------------")
print("ชนิดข้อมูล:",type(x),"\tข้อมูลคือ:",x)
print("ชนิดข้อมูล:",type(y),"\tข้อมูลคือ:",y)
print("ชนิดข้อมูล:",type(ans),"\tข้อมูลคือ:",ans)
print("--------------------------------------------------")
print("ชนิดข้อมูล:",type(fruit),"\tข้อมูลคือ:",fruit)
print("--------------------------------------------------")
print("ชนิดข้อมูล:",type(color),"\tข้อมูลคือ:",color)
print("--------------------------------------------------")
print("ชนิดข้อมูล:",type(data),"\tข้อมูลคือ:",list(data))
print("--------------------------------------------------")
print("ชนิดข้อมูล:",type(member),"\tข้อมูลคือ:",member)
print("--------------------------------------------------")
print("ชนิดข้อมูล:",type(True_man),"\tข้อมูลคือ:",True_man)
print("--------------------------------------------------")