list_a =['A',"C",5,True,"2D"]
list_b =['x','y','z',1,2,3]

# len(list_a)
print("--------------------------------------------------")
print("ชนิดข้อมูล:",type(list_a),"\tข้อมูลคือ list_a: ",list_a)
print("นับจำนวนข้อมูลใน list: ",len(list_a))
print("--------------------------------------------------")

print("--------------------------------------------------")
print("ชนิดข้อมูล:",type(list_a),"\tข้อมูลคือ list_a: ",list_a)
print("การดึงข้อมูลใน  list_a[index] :",list_a[-1])
print("--------------------------------------------------")

print("--------------------------------------------------")
print("ชนิดข้อมูล:",type(list_a),"\tข้อมูลคือ list_a: ",list_a)
print("การดึงข้อมูล Group ใน  list_a[index:index] :",list_a[1:4])
print("--------------------------------------------------")

print("--------------------------------------------------")
print("ชนิดข้อมูล:",type(list_a),"\tข้อมูลคือ list_a: ",list_a)
list_a.append("dog")
print("การเพิ่มข้อมูลใน  list_a.append(data) :",list_a)
print("--------------------------------------------------")

print("--------------------------------------------------")
print("ชนิดข้อมูล:",type(list_a),"\tข้อมูลคือ list_a: ",list_a)
print("ชนิดข้อมูล:",type(list_b),"\tข้อมูลคือ list_b: ",list_b)
list_a.extend(list_b)
print("การเพิ่มข้อมูล group ใน  list_a.extend(list_b) :",list_a)
print("--------------------------------------------------")

print("--------------------------------------------------")
print("ชนิดข้อมูล:",type(list_b),"\tข้อมูลคือ list_b: ",list_b)
list_b.insert(3,"cat")
print("การเพิ่มข้อมูลมูลใน  list_b.insert(index,data) :",list_b)
print("--------------------------------------------------")